#lab 1, task 1
a = int(input("Введите число "))
b = int(input("Введите число "))
S = a * b
P = 2 * (a + b)
print("Площадь прямоугольника",S)
print("Периметр прямоугольника",P)

#lab 1, task 2
d = int(input("Введите диаметр "))
p = 3.14
L = p * d
print("Длина окружности равна",L)

#lab 1, task 3
a = int(input("Введите число "))
b = int(input("Введите число "))
print("Среднее арифметическое чисел равно",(a+b)/2)

#lab 1, task 4
a = int(input("Введите ненулевое число "))
b = int(input("Введите ненулевое число "))
print("Сумма квадратов числе равна",a**2 + b**2)
print("Разность квадратов числе равна",a**2 - b**2)
print("Произведение квадратов числе равно",a**2 * b**2)
print("Частное квадратов числе равно",a**2 / b**2)

#lab 1, task 5
a = int(input("Введите ненулевое число "))
b = int(input("Введите ненулевое число "))
print("Сумма модулей чисел",abs(a)+abs(b))
print("Разность модулей чисел",abs(a)-abs(b))
print("Произведение модулей чисел",abs(a)*abs(b))
print("Частное модулей чисел",abs(a)/abs(b))




